
# ---------------------------------------------------------------
# 『Applied Statistical Modeling for Ecologists』のRコード 
# Kéry・Kellner著、Elsevier、2024年
# ---------------------------------------------------------------

# -----------------------------------------------------------------------
# 第3章：線形回帰モデルとその一般化線形モデル・
#          階層モデル・統合モデルへの拡張
# -----------------------------------------------------------------------

# 最終更新：2024年6月11日
#######################################################################
# --------------------------------------------------------------------#
#   3.2.1 正規分布
# --------------------------------------------------------------------#
#######################################################################


n <- 100000                                 # 標本サイズ
mu <- 600                                   # 母平均の値
sigma <- 30                                 # 母標準偏差の値
sample <- rnorm(n = n, mean = mu, sd = sigma)     # 乱数を生成
print(sample, dig = 4)                      # 生成した値を表示
hist(sample, col = "grey", breaks = 60, freq = F) # 生成した値を作図

#######################################################################
# --------------------------------------------------------------------#
#   3.2.2 一様分布
# --------------------------------------------------------------------#
#######################################################################

n <- 100000                                 # 標本サイズ
a <- lower.limit <- 0                       # 確率変数の下限
b <- upper.limit <- 10                      # 確率変数の上限
sample <- runif(n = n, min = a, max = b)    # 乱数を生成
print(sample, dig = 4)                      # 生成した値を表示
hist(sample, col = "grey", breaks = 30, freq = F) # 生成した値を作図

#######################################################################
# --------------------------------------------------------------------#
#   3.2.3 二項分布：「コイントス分布」
# --------------------------------------------------------------------#
#######################################################################

n <- 100000                                 # 標本サイズ
N <- 16                                     # コインを投げる個体数
p <- 0.8                                    # 計数（観察）・死亡・雄である確率
sample <- rbinom(n = n, size = N, prob = p) # 乱数を生成
print(sample, dig = 4)                      # 生成した値を表示
plot(table(sample)/n, ylab = '確率', type = 'h', lwd = 20, col = rgb(0, 0, 0, 0.5),
xlim = c(0, 16), lend = 'butt', frame = F)  # 生成した値を作図

#######################################################################
# --------------------------------------------------------------------#
#   3.2.4 ポアソン分布
# --------------------------------------------------------------------#
#######################################################################

n <- 100000                                 # 標本サイズ
lambda <- 5                                 # 観測区画当たりの平均計数（密度または強度）
sample <- rpois(n = n, lambda = lambda)     # 乱数を生成
print(sample, dig = 4)                      # 生成した値を表示
plot(table(sample)/n, ylab = '確率', type = 'h', lwd = 20,col = rgb(0, 0, 0, 0.5),
lend = 'butt', frame = F)                   # 生成した値を作図

#######################################################################
# --------------------------------------------------------------------#
#   3.4 共変量効果の線形モデル化
# --------------------------------------------------------------------#
#######################################################################

# 3.4 共変量効果の線形モデル化
# ----------------------------------------

mass <- c(60, 80, 50, 70, 90, 110)   # 応答変数（連続型）
pop <- factor(c(1, 1, 2, 2, 3, 3))   # カテゴリ共変量（因子）
reg <- factor(c(1, 1, 1, 1, 2, 2))   # 別の因子
hab <- factor(c(1, 2, 3, 1, 2, 3))   # さらに別の因子
length <- c(40, 45, 39, 50, 52, 56)  # 連続共変量

# 連続共変量 with quantitative values
mass
# カテゴリ共変量（因子）
pop

#   3.4.1 「平均モデル」
# -------------------------------

lm(mass ~ 1)

model.matrix(mass ~ 1)


#   3.4.2 2グループの比較
# --------------------------------

model.matrix( ~ reg)

lm(mass ~ reg)

lm(mass ~ reg - 1) # 本文には掲載されていない
model.matrix( ~ reg - 1)


#   3.4.3 単純線形回帰：1つの連続共変量の効果
# ---------------------------------------------------------------------------------

model.matrix(~ length)

lm(mass ~ length)

lm(mass ~ I(length - mean(length)))

model.matrix( ~ length - 1)


#   3.4.4 1つのカテゴリ共変量（因子）の効果
# --------------------------------------------------------------------

model.matrix(~pop)

lm(mass ~ pop) # 効果母数化でモデルを当てはめる（Rの既定設定）

model.matrix(~ pop - 1)

lm(mass ~ pop - 1) # 平均値母数化でモデルを当てはめる


#   3.4.5 2つの因子の効果
# -------------------------------------------

lm(mass ~ reg + hab)

model.matrix( ~ reg + hab)

lm(mass ~ reg * hab)

model.matrix(~ reg * hab)

table(reg, hab)

alias(lm(mass ~ reg*hab))

lm(mass ~ reg * hab - 1 - reg - hab)

model.matrix(mass ~ reg * hab - 1 - reg - hab)


#   3.4.6 因子と連続共変量の効果
# -----------------------------------------------------------------

model.matrix( ~ pop + length)

lm(mass ~ pop + length)              # 既定の方法でモデルを当てはめる
DM <- model.matrix(~pop + length)    # デザイン行列DMを作成
lm(mass ~ DM-1)                      # 明示したデザイン行列DMで同じモデルを当てはめる

par(mfrow = c(1, 2)) # 図3-5の左側
fm <- lm(mass ~ pop + length)        # モデルを再度当てはめる
plot(length, mass, col = c(rep("red", 2), rep("blue", 2), rep("green", 2)),
pch = 16, cex = 1.5, ylim = c(40, 120), frame = FALSE)
abline(fm$coef[1], fm$coef[4], col = rgb(1, 0, 0, 0.5), lwd = 2)
abline(fm$coef[1] + fm$coef[2], fm$coef[4], col = rgb(0, 0, 1, 0.5), lwd = 2)
abline(fm$coef[1] + fm$coef[3], fm$coef[4], col = rgb(0, 1, 0, 0.5), lwd = 2)

model.matrix( ~ pop * length)

lm(mass ~ pop * length)

fm <- lm(mass ~ pop * length)        # モデルを再度当てはめる（図3-5の右側）
plot(length, mass, col = c(rep("red", 2), rep("blue", 2), rep("green", 2)),
pch = 16, cex = 1.5, ylim = c(40, 120), frame = FALSE)
abline(fm$coef[1], fm$coef[4], col = rgb(1, 0, 0, 0.5), lwd = 2)
abline(fm$coef[1] + fm$coef[2], fm$coef[4] + fm$coef[5], col = rgb(0, 0, 1, 0.5), lwd = 2)
abline(fm$coef[1] + fm$coef[3], fm$coef[4] + fm$coef[6], col = rgb(0, 1, 0, 0.5), lwd = 2)

model.matrix( ~ pop + length - 1)

lm(mass ~ pop + length - 1)

model.matrix( ~ pop * length - 1 - length)

lm(mass ~ pop * length - 1 - length)
summary(lm(mass ~ pop * length - 1 - length)) # 本文には掲載されていない



